/* ============================================================================================================
// EN: Notifies the compiler that there should be a character at the end of each expression ;
// RU: Сообщает компилятору о том, что в конце каждого выражения должен стоять символ ;
// ==========================================================================================================*/

#pragma semicolon 1
/* =============================================================================================================
// EN: Notifies the compiler that the plugin syntax is exceptionally new
// RU: Сообщает компилятору о том, что синтаксис плагина исключительно новый
// ===========================================================================================================*/
#pragma newdecls required

/* =============================================================================================================
// EN: Public information about the plugin.
// RU: Общественная информация о плагине.
// ===========================================================================================================*/
public Plugin myinfo = 
{
	/* ============================================================================================================
	// EN: The name of the plugin.
	// RU: Название плагина. 
	// ===========================================================================================================*/
	name = "[v34] Game Description Override", 
	/* ============================================================================================================
	// EN: The author of the plugin.
	// RU: Автор плагина.
	// ==========================================================================================================*/
	author = "babka68", 
	/* ============================================================================================================
	// EN: A brief description of the plugin.
	// RU: Краткое описание плагина.
	// ==========================================================================================================*/
	description = "Переопределение описание 'Игра'", 
	/* ============================================================================================================
	// EN: The version of this plugin.
	// RU: Версия данного плагина.
	// ===========================================================================================================*/
	version = "1.0", 
	/* ============================================================================================================
	// EN: Plugin (author's) support site.
	// RU: Сайт поддержки плагина (автора).
	// ===========================================================================================================*/
	url = "https://vk.com/zakazserver68"
};

/* =============================================================================================================
// EN: Declaring a new variable g_beadle to store one of 2 boolean values (now the default is false or 0).
// RU: Объявляем новую переменную g_bEnadle для хранения одного из 2 логических значений (сейчас по умолчанию - false или 0).
// =============================================================================================================*/
bool g_bEnadle;

/* =============================================================================================================
// EN: Declaring a new variable g_game_Description_Override for storing characters (has limits: from 0 to 255)
// RU: Объявляем новую переменную g_sGame_Description_Override для хранения символов (имеет пределы: от 0 до 255)
// =============================================================================================================*/
char g_sGame_Description_Override[PLATFORM_MAX_PATH];

/* =============================================================================================================
// EN: A built-in global event whose function is a single call when the plugin is fully initialized.
// RU: Встроенное глобальное событие, функция которого - единождый вызов при полной инициализации плагина.
// =============================================================================================================*/
public void OnPluginStart()
{
	/* =============================================================================================================
	// EN: Register a local ConVar and call it cvar
	// RU: Зарегистрируйте локальный ConVar и назовите его cvar
	// =============================================================================================================*/
	ConVar cvar;
	
	/* =============================================================================================================
	// EN: Create a quar "sm_game_description_override_enable" and equate its value to the previously created cvar descriptor. We set it to a minimum of 0, a maximum of 1.
	// RU: Создайте "sm_game_description_override_enable" и приравняйте его значение к ранее созданному дескриптору cvar. Мы устанавливаем его как минимум на 0, максимум на 1.
	// =============================================================================================================*/
	cvar = CreateConVar("sm_game_description_override_enable", "1", "Включить плагин? [1 - Включить, 0 - Нет]", _, true, 0.0, true, 1.0);
	
	/* =============================================================================================================
	// EN: Create a quar "sm_game_description_override" and equate its value to the previously created cvar descriptor.
	// RU: Создайте "sm_game_description_override" и приравняйте его значение к ранее созданному дескриптору cvar.
	// =============================================================================================================*/
	cvar = CreateConVar("sm_game_description_override", "Skins|CS:GO", "Установить описание игры при загрузке сервера (максимум 64 символа)");
	
	/* =============================================================================================================
	// EN: Assign a logical global value to bool
	// RU: Присвоите логическое глобальное значение bool
	// =============================================================================================================*/
	g_bEnadle = cvar.BoolValue;
	
	/* =============================================================================================================
	// EN: Assign a string global value to string
	// RU: Присвоите строковому глобальному значению string
	// =============================================================================================================*/
	cvar.GetString(g_sGame_Description_Override, sizeof(g_sGame_Description_Override));
	
	/* =============================================================================================================
	// EN: Creates a hook for when a console variable's value is changed.
	// RU: Создает перехватчик при изменении значения консольной переменной.
	// =============================================================================================================*/
	cvar.AddChangeHook(Change_Enable);
	
	/* =============================================================================================================
	// EN: Creates a hook for when a console variable's value is changed.
	// RU: Создает перехватчик при изменении значения консольной переменной.
	// =============================================================================================================*/
	cvar.AddChangeHook(Change_Game_Description_Override);
	
	/* =============================================================================================================
	// EN: Specifies that the given config file should be executed after plugin load.
	// RU: Указывает, что данный конфигурационный файл должен быть выполнен после загрузки плагина. 
	// =============================================================================================================*/
	AutoExecConfig(true, "game_description_override");
}

/* =============================================================================================================
// EN: Change_Enable callback function.
// RU: Функция обратного вызова Change_Enable.
// =============================================================================================================*/
public void Change_Enable(ConVar cvar, const char[] oldValue, const char[] newValue)
{
	/* =============================================================================================================
	// EN: Assign a logical global value to bool
	// RU: Присвоите логическое глобальное значение bool
	// =============================================================================================================*/
	g_bEnadle = cvar.BoolValue;
}

/* =============================================================================================================
// EN: Change_Game_Description_Override callback function.
// RU: Функция обратного вызова Change_Game_Description_Override.
// =============================================================================================================*/
public void Change_Game_Description_Override(ConVar cvar, const char[] oldValue, const char[] newValue)
{
	/* =============================================================================================================
	// EN: Assign a string global value to string
	// RU: Присвоите строковому глобальному значению string
	// =============================================================================================================*/
	cvar.GetString(g_sGame_Description_Override, sizeof(g_sGame_Description_Override));
}

public Action OnGetGameDescription(char gameDesc[64])
{
	/* =============================================================================================================
	// EN: if the plugin is enabled, then we continue further
	// RU: Если плагин включен, то мы продолжаем дальше
	// =============================================================================================================*/
	if (g_bEnadle)
	{
		/* =============================================================================================================
		// EN: If the description of the game is not set (empty), then we will report it to the SourceMod logs.
		// RU: Если описание игры не задано (пустое), то мы сообщим об этом в логах SourceMod.
		// =============================================================================================================*/
		if (StrEqual(g_sGame_Description_Override, ""))
		{
			/* =============================================================================================================
			// EN: Logs a plugin error message to the SourceMod logs.
			// RU: Записывает сообщение об ошибке плагина в журналы SourceMod.
			// =============================================================================================================*/
			LogError("Описание игры не задано, пожалуйста, установите его в вашем скрипте запуска с помощью +sm_game_description_override");
		}
		
		/* =============================================================================================================
		// EN: Otherwise, copy the description of the game and install it
		// RU: В противном случае скопируйте описание игры и установите его
		// =============================================================================================================*/
		else
		{
			//PrintToServer("[v34] Game Description Override Описание игры установлено на %s", g_sGame_Description_Override);
			strcopy(gameDesc, sizeof(gameDesc), g_sGame_Description_Override);
		}
	}
	
	/* =============================================================================================================
	// EN: Allows the continuation of the event with changes
	// RU: Позволяет продолжить мероприятие с изменениями
	// =============================================================================================================*/
	return Plugin_Changed;
}
